import enum

class OrderStatus(enum.Enum):
    # --- 1. Формирование заказа ---
    CART = "cart" # корзина покупателя (пользователь собирает товары)

    # --- 2. Оформление и оплата ---
    PENDING = "pending" # ожидает оплаты (пользователь нажал "оформить", ждем транзакцию)

    # --- 3. Обработка заведением / магазином ---
    AWAITING_CONFIRMATION = "awaiting_confirmation" # ожидает подтверждения оператора (оплачено или выбрана оплата при получении)
    CONFIRMED = "confirmed" # подтвержден (оператор принял заказ в работу)
    PREPARING = "preparing" # подготовка заказа (повара готовят / кладовщики собирают)

    # --- 4. Доставка ---
    IN_TRANSIT = "in_transit" # в пути (передан курьеру)
    DELIVERED = "delivered" # доставлен (отдан клиенту)

    # --- 5. Финальные (терминальные) статусы ---
    CLOSED = "closed" # закрыт (сделка полностью завершена, деньги зачислены, архив)
    CANCELLED = "cancelled" # отменен (может произойти на любом из этапов выше)